ams/src/Catalogs/_ПродукцияКомпании/_ПродукцияКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>_ПродукцияКомпании</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Макет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоМЕГА</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеОбщее</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтарая</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Catalogs/_ПродукцияКомпании/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	МассивСтрок = Объект.Товары.Выгрузить(,"Номенклатура").ВыгрузитьКолонку("Номенклатура");
	ПроверитьДубли(Объект.Ссылка,МассивСтрок,Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаФормы()
	Элементы.Макет.Видимость = AMS_ВызовСервера.ЭтоKhors();
КонецПроцедуры

&НаСервере
Процедура ПроверитьДубли(Ссылка,МассивСтрок,Отказ)
	Запрос = Новый Запрос;
	                               
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	д.Ссылка КАК Продукция,
	|	т.Номенклатура КАК Номенклатура,
	|	т.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник._ПродукцияКомпании.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ПродукцияКомпании КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	т.Номенклатура В(&Номенклатура)" + ?(ЗначениеЗаполнено(Ссылка)," И д.Ссылка <> &Ссылка","");
	
	Запрос.УстановитьПараметр("Ссылка"      , Ссылка);
	Запрос.УстановитьПараметр("Номенклатура", МассивСтрок);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				НСтр("ru = 'Номенклатура ""%1"" уже введена для продукции ""%2"" в строке %3'"),
				Выборка.Номенклатура,Выборка.Продукция,Выборка.НомерСтроки),,,,Отказ);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
